import {T_Airline} from "src/modules/types.ts";

export const AirlineMocks:T_Airline[] = [
    {
        id: 1,
        name: "Аэрофлот",
        status: 1,
        image: "",
        description: "«Аэрофлот — российские авиалинии» — российская государственно-частная авиакомпания, образованная из одного из государственных социалистических предприятий, входившего в состав советского «Аэрофлота» и осуществлявшего полёты и коммерческую деятельность на международных воздушных линиях, а также завладевшего правами на одноимённую торговую марку.",
        foundation_date: 1923
    },
    {
        id: 2,
        name: "Победа",
        status: 1,
        image: "",
        description: "«Побе́да» (юридическое название — ООО «Авиакомпания Победа») — российская бюджетная авиакомпания, дочернее предприятие группы «Аэрофлот — Российские авиалинии», базируется в московском аэропорту Внуково. Основана 16 сентября 2014 года взамен прекратившего полёты из-за санкций Европейского союза «Добролёта». Суточный налёт самолётов авиакомпании в 2017 году был самым высоким в мире — 15—16 часов, что было выше, чем у крупнейших мировых лоукостеров — американской Southwest и ирландской Ryanair.",
        foundation_date: 2014
    },
    {
        id: 3,
        name: "Россия",
        status: 1,
        image: "",
        description: "Росси́я (юридическое название АО «Авиакомпания «Россия») — российская авиакомпания, входит в состав группы «Аэрофлот». Один из крупнейших авиаперевозчиков России. Основана 7 мая 1934 года. Специализируется на перевозках в среднем ценовом сегменте и предоставляет пассажирам полный спектр сервиса в двух классах обслуживания — экономический и бизнес.",
        foundation_date: 1934
    },
    {
        id: 4,
        name: "Уральские авиалинии",
        status: 1,
        image: "",
        description: "Ура́льские авиали́нии — российская пассажирская авиакомпания, занимающаяся регулярными и чартерными внутренними и международными перевозками. Штаб-квартира расположена в Екатеринбурге. Парк воздушных судов авиакомпании «Уральские Авиалинии» состоит из самолётов семейства А320 концерна Airbus, что очень упрощает обучению пилотов. У компании есть хабы в екатеринбургском аэропорту «Кольцово» и московском аэропорту «Домодедово», а также центры технического обслуживания судов в аэропортах «Кольцово» (Екатеринбург), «Домодедово» (Москва), «Пулково» (Санкт-Петербург).",
        foundation_date: 1943
    }
]